OpenPuya/PY32M010_Firmware/Drivers/PY32M010_HAL_Driver/Inc/py32m010_ll_flash.h
/**
  ******************************************************************************
  * @file    py32m010_ll_flash.h
  * @author  MCU Application Team
  * @brief   Header file of FLASH LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32M010_LL_FLASH_H
#define PY32M010_LL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32mxxx.h"



/** @addtogroup PY32M010_LL_Driver
  * @{
  */

#if defined (FLASH)

/** @defgroup FLASH_LL FLASH
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/** @defgroup FLASH_LL_Exported_Constants FLASH Exported Constants
  * @{
  */

/** @defgroup FLASH_LL_EC_BOR_ENABLE BOR Enable
  * @{
  */
#define LL_FLASH_BOR_DISABLE   (0x00000000U)                                                        /*!< BOR Reset Disable    */
#define LL_FLASH_BOR_ENABLE    (FLASH_OPTR_BOR_EN)                                                  /*!< BOR Reset Enable     */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_BOR_LEVEL BOR Level
  * @{
  */
#define LL_FLASH_BOR_LEV0      (0x00000000)                                                         /*!< BOR Reset threshold levels for 1.7V - 1.8V VDD power supply    */
#define LL_FLASH_BOR_LEV1      (                                              FLASH_OPTR_BOR_LEV_0) /*!< BOR Reset threshold levels for 1.9V - 2.0V VDD power supply    */
#define LL_FLASH_BOR_LEV2      (                       FLASH_OPTR_BOR_LEV_1                       ) /*!< BOR Reset threshold levels for 2.1V - 2.2V VDD power supply    */
#define LL_FLASH_BOR_LEV3      (                       FLASH_OPTR_BOR_LEV_1 | FLASH_OPTR_BOR_LEV_0) /*!< BOR Reset threshold levels for 2.3V - 2.4V VDD power supply    */
#define LL_FLASH_BOR_LEV4      (FLASH_OPTR_BOR_LEV_2                                              ) /*!< BOR Reset threshold levels for 2.5V - 2.6V VDD power supply    */
#define LL_FLASH_BOR_LEV5      (FLASH_OPTR_BOR_LEV_2                        | FLASH_OPTR_BOR_LEV_0) /*!< BOR Reset threshold levels for 2.7V - 2.8V VDD power supply    */
#define LL_FLASH_BOR_LEV6      (FLASH_OPTR_BOR_LEV_2 | FLASH_OPTR_BOR_LEV_1                       ) /*!< BOR Reset threshold levels for 2.9V - 3.0V VDD power supply    */
#define LL_FLASH_BOR_LEV7      (FLASH_OPTR_BOR_LEV_2 | FLASH_OPTR_BOR_LEV_1 | FLASH_OPTR_BOR_LEV_0) /*!< BOR Reset threshold levels for 3.1V - 3.2V VDD power supply   */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_SWDNRST Swd Nrst Mode
  * @{
  */
#define LL_FLASH_SWD_PB6_NRST_PC0      (0x00000000U)                                         /*!< PB6:SWD,PC0:NRST */
#define LL_FLASH_SWD_PB6_GPIO_PC0      (FLASH_OPTR_NRST_MODE)                                /*!< PB6:SWD,PC0:GPIO */
#define LL_FLASH_SWD_PC0_GPIO_PB6      (FLASH_OPTR_NRST_MODE | FLASH_OPTR_SWD_MODE )         /*!< PC0:SWD,PB6:GPIO */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_IWDGMODE IWDG Mode
  * @{
  */
#define LL_FLASH_IWDG_MODE_HW          (0x00000000U)                                         /*!< Hardware IWDG selected */
#define LL_FLASH_IWDG_MODE_SW          (FLASH_OPTR_IWDG_SW)                                  /*!< Software IWDG selected */

/**
  * @}
  */
#if defined(FLASH_OPTR_IWDG_STOP)
/** @defgroup FLASH_LL_EC_IWDG_INSTOP IWDG In Stop
  * @{
  */
#define LL_FLASH_IWDG_INSTOP_FREEZE    (0x00000000U)                                         /*!< Freeze IWDG counter in STOP mode */  
#define LL_FLASH_IWDG_INSTOP_ACTIVE    (FLASH_OPTR_IWDG_STOP)                                /*!< IWDG counter active in STOP mode */

/**
  * @}
  */
#endif

/** @defgroup FLASH_LL_EC_BOOTMODE Boot Mode
  * @{
  */
#define LL_FLASH_BOOTMODE_MAINFLASH    (0x00000000U)                                         /*!< Main Flash start   */
#define LL_FLASH_BOOTMODE_LOADFLASH    (FLASH_BTCR_NBOOT1 | FLASH_BTCR_BOOT0)                /*!< Load Flash start   */
#define LL_FLASH_BOOTMODE_SRAM         (FLASH_BTCR_BOOT0)                                    /*!< Sram start   */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_LOADFLASH LoadLFlash Size
  * @{
  */
#define LL_FLASH_LOADFLASH_NONE        (0x00000000U)                                     /*!< LoadFlash size None */
#define LL_FLASH_LOADFLASH_1K          (FLASH_BTCR_BOOT_SIZE_0)                          /*!< LoadFlash size 1k   */
#define LL_FLASH_LOADFLASH_2K          (FLASH_BTCR_BOOT_SIZE_1)                          /*!< LoadFlash size 2k   */
#define LL_FLASH_LOADFLASH_3K          (FLASH_BTCR_BOOT_SIZE_1 | FLASH_BTCR_BOOT_SIZE_0) /*!< LoadFlash size 3k   */
#define LL_FLASH_LOADFLASH_4K          (FLASH_BTCR_BOOT_SIZE_2)                          /*!< LoadFlash size 4k   */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_WRP Write Protection
  * @{
  */
#define LL_FLASH_WRP_DISABLE           ((uint32_t)0x00000000)       /* Write protection disable */
#define LL_FLASH_WRP_SECTOR_0          ((uint32_t)FLASH_WRPR_WRP_0) /* Write protection of Sector0 */
#define LL_FLASH_WRP_SECTOR_1          ((uint32_t)FLASH_WRPR_WRP_1) /* Write protection of Sector1 */
#define LL_FLASH_WRP_SECTOR_2          ((uint32_t)FLASH_WRPR_WRP_2) /* Write protection of Sector2 */
#define LL_FLASH_WRP_SECTOR_3          ((uint32_t)FLASH_WRPR_WRP_3) /* Write protection of Sector3 */
#define LL_FLASH_WRP_SECTOR_4          ((uint32_t)FLASH_WRPR_WRP_4) /* Write protection of Sector4 */
#define LL_FLASH_WRP_SECTOR_5          ((uint32_t)FLASH_WRPR_WRP_5) /* Write protection of Sector5 */

#define LL_FLASH_WRP_Pages0to31        ((uint32_t)FLASH_WRPR_WRP_0) /* Write protection from page0   to page31 */
#define LL_FLASH_WRP_Pages32to63       ((uint32_t)FLASH_WRPR_WRP_1) /* Write protection from page32  to page63 */
#define LL_FLASH_WRP_Pages64to95       ((uint32_t)FLASH_WRPR_WRP_2) /* Write protection from page64  to page95 */
#define LL_FLASH_WRP_Pages96to127      ((uint32_t)FLASH_WRPR_WRP_3) /* Write protection from page96  to page127 */
#define LL_FLASH_WRP_Pages128to159     ((uint32_t)FLASH_WRPR_WRP_4) /* Write protection from page128 to page159 */
#define LL_FLASH_WRP_Pages160to191     ((uint32_t)FLASH_WRPR_WRP_5) /* Write protection from page160 to page191 */

#define LL_FLASH_WRP_AllPages          ((uint32_t)0x0000003FU)      /*!< Write protection of all Sectors */
/**
  * @}
  */

